export const cardSlots = ['圣杯', '羊皮纸', '指南针', '钟', '镜子', '天秤']

export const cardClasses = [
  {
    name: 'PVE 攻击 / 精灵',
    cards: {
      '活力': ['时间 (战速+强基)', '生命', '自由 (命中)', '正义 (防御)', '幻象 (CD)'],
      '魔力': ['空间 (移速+格挡)', '命运 (精神+铁壁)', '死亡 (暴击)', '破坏 (攻击)', '智慧 (强击)'],
      '狂奔': ['时间 (战速+强基)', '生命', '自由 (命中)', '正义 (防御)', '幻象 (CD)', '正义+生命'],
      '纯血': ['空间 (移速+格挡)', '命运 (精神+铁壁)', '死亡 (暴击)', '破坏 (攻击)', '智慧 (强击)', '破坏+命运'],
    },
    recommend: ['活力', '纯血', '狂奔/活力', '纯血', '狂奔', '狂奔'],
  },
  {
    name: '奶妈',
    cards: {
      '主推': ['时间 (战速+强基)', '生命', '自由 (命中)', '正义 (防御)', '幻象 (CD)', '正义+生命'],
      '副选': ['空间 (移速+格挡)', '命运 (精神+铁壁)', '死亡 (暴击)', '破坏 (攻击)', '', ''],
    },
    recommend: ['活力', '纯血', '狂奔/活力', '纯血', '狂奔', '狂奔'],
  },
  {
    name: 'DPS',
    cards: {
      '主推': ['时间 (战速+强基)', '生命', '自由 (命中)', '破坏 (攻击)', '智慧 (强击)', '破坏+命运'],
      '副选': ['', '', '死亡 (暴击)', '', '', ''],
    },
    recommend: ['狂奔/活力', '狂奔/活力', '纯血', '纯血', '纯血', '纯血'],
  },
  {
    name: '魔道',
    cards: {
      '主推': ['时间 (战速+强基)', '生命', '自由 (命中)', '破坏 (攻击)', '幻象 (CD)', '破坏+命运'],
      '副选': ['', '命运 (精神+铁壁)', '死亡 (暴击)', '', '', ''],
    },
    recommend: ['活力/狂奔', '纯血 (只能选这个)', '纯血', '纯血', '活力/狂奔', '纯血'],
  },
  {
    name: '贼',
    cards: {},
    recommend: ['活力/狂奔', '纯血 (只能选这个)', '纯血 (只能选这个) / 纯血 (只能选这个)', '纯血', '活力/狂奔', '纯血'],
  },
]
