export const calcSheets = [
  {
    title: '愤怒系列（默认套）',
    materials: [
      ['愤怒思念', 500, 2],
      ['愤怒意志', 150, 3],
      ['愤怒自我', 120, 7],
      ['达人金装', 260, 3],
      ['达人提炼石', 200, 6],
      ['金宝石', 70, 12],
      ['金奥德', 70, 7],
    ],
  },
  {
    title: '天龍王 配方',
    materials: [
      ['愤怒思念', 300, 18],
      ['愤怒意志', 200, 27],
      ['愤怒自我', 103, 42],
      ['愤怒願望', 135, 19],
      ['金宝石', 60, 121],
      ['金奥德', 60, 70],
      ['提煉石', 200, 7],
      ['金裝', 200, 4],
    ],
  },
  {
    title: '副本2 配方（自定）',
    materials: [
      ['材料1', 200, 5],
      ['材料2', 300, 50],
      ['材料3', 40, 122],
      ['材料4', 400, 18],
      ['材料5', 270, 27],
      ['材料6', 100, 42],
      ['材料7', 160, 19],
      ['材料8', 75, 121],
      ['材料9', 75, 70],
    ],
  },
]
